/*
Navicat MySQL Data Transfer

Source Server         : mysql
Source Server Version : 50511
Source Host           : localhost:3306
Source Database       : book

Target Server Type    : MYSQL
Target Server Version : 50511
File Encoding         : 65001

*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `admin`
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', '1', 'iUOoOdMAl7FsB1Kig37hmg==');

-- ----------------------------
-- Table structure for `book`
-- ----------------------------
DROP TABLE IF EXISTS `book`;
CREATE TABLE `book` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL COMMENT '名称',
  `cover` varchar(255) DEFAULT NULL COMMENT '封面',
  `price` float DEFAULT NULL COMMENT '价格',
  `intro` varchar(1024) DEFAULT NULL COMMENT '介绍',
  `auther` varchar(255) DEFAULT NULL COMMENT '作者',
  `press` varchar(255) DEFAULT NULL COMMENT '出版社',
  `pubdate` date DEFAULT NULL COMMENT '出版日期',
  `special` int(1) DEFAULT '0' COMMENT '特卖',
  `news` int(1) DEFAULT '0' COMMENT '新书',
  `sale` int(1) DEFAULT '0' COMMENT '打折',
  `category_id` int(11) DEFAULT NULL COMMENT '分类',
  `count` int(11) DEFAULT 1 COMMENT '库存',
  `ISBNcode` int(11) DEFAULT 1 COMMENT 'ISBN号',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of book
-- ----------------------------
INSERT INTO `book` VALUES ('1', '罗伯特议事规则', '/picture/1.jpg', '40.9', '罗伯特家族在其生前全面增修版基础上，倾力修订改进的权威、详尽的议学经典！根据2000年由美国Perseus出版的官方版本翻译而成，原版总销量已逾500万册。《央视新闻周刊—岩松说》重磅推荐！', '罗伯特', '格致出版社', '2008-05-01', '0', '0', '0', '2','2','1');
INSERT INTO `book` VALUES ('2', '重新发现社会', '/picture/2.jpg', '26.9', '《重新发现社会》(修订本)对身处“历史三峡”中的中国及其前途作了一次通盘思考，内容涉及政治、经济、社会以及历史、文化、互联网等领域。作者以“中国，重新发现社会”为大脉络，既条分缕析了国家与社会的关系，又提纲挈领地记录了近几十年来中国社会的革命性成长。如何超越左右纷争，重建国家伦理底线；如何重新焕发社会的活力与创造、扶正个体的权益与价值，即在“自由即秩序”的条件下建设一个“新新中国”，是本书探讨的重点。', '熊培云', '新星出版社', '2011-05-01', '0', '1', '0', '2','2','2');
INSERT INTO `book` VALUES ('3', '鲁迅经典全集', '/picture/3.jpg', '141.6', '至于作者为什么对中国未来有信心，读者当能从本书中找到答案。', '鲁迅', '湖南人民出版社', '2015-09-01', '0', '0', '0', '1','2','3');
INSERT INTO `book` VALUES ('4', '触及灵魂的旅行', '/picture/4.jpg', '21', '旅途不仅是行走，更是与自己的心灵和解、与世界温柔相拥的过程。灵魂命令我们对这星球的美一见倾心。人不能一味走下去，要驻扎在行程的空隙中，和灵魂会合。《人生终要有一场触及灵魂的旅行》是毕淑敏在环球旅行后的最美的心得，是一场清新温暖的治愈系环球旅行，更是一次与灵魂见面的约定。本书以作者近年来的旅行心得为主题，收集了游记、手札23篇。如同一个睿智、风趣而又宽厚的旅伴，带你走进一段柔软的时光，让心灵安静的绽放。去寻找那些曾出现在梦境中的路径、山峦与田野吧，趁阳光正好，趁微风不噪，趁繁花还未开至荼蘼，趁现在还年轻，还可以走很长很长的路，还能诉说很深很深的思念。', '毕淑敏', '湖南文艺出版社', '2014-02-01', '0', '0', '0', '1','2','4');
INSERT INTO `book` VALUES ('5', '物种起源', '/picture/5.jpg', '37.4', '《物种起源》是达尔文（1809-1882年）论述生物进化论的重要著作，出版于1859年11月24日。该书大概是19世纪最具有争议的著作，其中的观点大多数为当今科学界普遍接受。在该书中，达尔文首次提出了进化论的观点。他使用自己在19世纪30年代环球科学考察中积累的资料，试图证明物种的演化是通过自然选择（天择）和人工选择（人择）的方式实现的。', '查理·达尔文 ', '江苏人民出版社', '2011-03-01', '0', '0', '0', '3','2','5');
INSERT INTO `book` VALUES ('6', '相对论', '/picture/6.jpg', '24', '这是一部彻底颠覆经典物理学观念的创世之书。它否定了牛顿的绝对时空观，认为空间不是平直的欧几里得空间，而是在引力场中弯曲的黎曼空间；时间也不是独立于空间的单独一维，它无时无刻不在空间之中，与空间构成一个统一的四维时空整体。这是一部并非凭借双眼，而是用智慧发现并创建了宇宙新秩序的书。它揭示了宇宙所具有的超乎寻常的秘密；同时性的相对性；运动中的钟慢、尺缩效应；水星的近日点异动；光谱红移；引力场中时钟变慢等。', '阿尔伯特·爱因斯坦 ', '江苏人民出版社', '2011-03-01', '1', '0', '0', '3','2','6');
INSERT INTO `book` VALUES ('7', '明朝那些事儿', '/picture/7.jpg', '138.6', '《明朝那些事儿》这篇文主要讲述的是从1344年到1644年这三百年间关于明朝的一些事情，以史料为基础，以年代和具体人物为主线，并加入了小说的笔法，对明朝十七帝和其他王公权贵和小人物的命运进行全景展示，尤其对官场政治、战争、帝王心术着墨最多，并加入对当时政治经济制度、人伦道德的演义。', '当年明月', '浙江人民出版社', '2011-12-01', '0', '0', '0', '4','2','7');
INSERT INTO `book` VALUES ('8', '这个历史挺靠谱', '/picture/8.jpg', '49.5', '《这个历史挺靠谱：袁腾飞讲历史》是《历史是个什么玩意儿》系列的升级珍藏版。本系列开启全民读史新潮流，自问世以来畅销至今，第一册为《这个历史挺靠谱：袁腾飞讲中国史.上》，第二册为《这个历史挺靠谱：袁腾飞讲中国史.下》，第三册为《这个历史挺靠谱：袁腾飞讲世界史》（注：将原《历史是个什么玩意儿3：袁腾飞说世界史上》和《历史是个什么玩意儿4：袁腾飞说世界史下》合并为一本，内容更扎实、更实惠）。', '袁腾飞', '湖南人民出版社', '2013-07-01', '0', '1', '0', '4','2','8');
INSERT INTO `book` VALUES ('9', '芈月传', '/picture/9.jpg', '135.8', '战国时期，芈月是楚威王最宠爱的小公主，但在楚威王死后生活一落千丈，母亲向氏被楚威后逐出宫，芈月和弟弟芈戎躲过了一次次灾难和危机。芈月与楚公子黄歇青梅竹马，真心相爱，但被作为嫡公主芈姝的陪嫁媵侍远嫁秦国。芈姝当上了秦国的王后，芈月不得已成为宠妃。原本的姐妹之情在芈月生下儿子嬴稷以后渐渐分裂。诸子争位，秦王嬴驷抱憾而亡。芈月和儿子被发配到遥远的燕国。不料秦武王嬴荡举鼎而亡，秦国大乱。芈月借义渠军力回到秦国，平定了秦国内乱。芈月儿子嬴稷登基为王，史称秦昭襄王。芈月当上了史上第一个皇太后，史称宣太后。', '蒋胜男', '浙江文艺出版社', '2015-11-01', '1', '0', '0', '5','2','9');
INSERT INTO `book` VALUES ('10', '献给亲爱的邵先生', '/picture/10.jpg', '44.3', '他高冷疏淡，惜字如金，回答她永远只有一个字：“好”。她觉得，他一字，重若千钧。新人气作家浮光锦暖心之作，两万字番外倾情放送。2015年度暖萌动人的纯粹深爱。每一个努力向上的女孩，都值得一个深情如斯的邵先生，谨以此文，献给所有为爱情努力变得更好的女孩。', '浮光锦', '江苏文艺出版社', '2015-10-01', '0', '0', '0', '5','2','10');
INSERT INTO `book` VALUES ('11', '陶艺制作圣经', '/picture/11.jpg', '148.5', '《陶艺制作圣经》所演示的技术，采用开放式的诠释而非指令、说明书似的语气，从不建议只有一种方法可达成目标；《陶艺制作圣经》也不会指出应做什么东西；成型步骤如同机械构件，在探索技术的可能性的同时拥有更多创作上的自由；用非传统的方法挑战传统的方法；我们也会探讨**的技术和操作实践。目的是鼓励读者的实验性和好奇心，为将来的陶艺创作建立自信心，并打下坚实基础。', '泰勒', '北京美术摄影出版社', '2014-05-01', '1', '0', '0', '6','2','11');
INSERT INTO `book` VALUES ('12', '中国陶瓷史增订版', '/picture/12.jpg', '266', '《中国陶瓷史》的主要内容是：古陶瓷学界耆宿叶喆民先生的这部通史巨著，是在其《中国陶瓷史纲要》一书基础上结合近年新发现、新成果倾力著成，集中体现了作者的治学方法：科学研究与传统鉴定方法并重；注重实地考察，并同文献和传统经验相结合，而非孤立、片面地轻断真伪、迟早；同时，不轻易放过窑址出土的特殊品种或典型瓷片。对于各大窑系的分类，作者运用比较学方法来对比观察相似品种及其烧成方法，联系地质特征与历史渊源，找出其主流或分支而理清脉络，例如他在1977—1985年对汝窑窑址的发现和认定，即是用此种方法取得的重大成果。在古陶瓷鉴定与鉴赏方面，作者提倡“既识真假，亦辨美丑”，“既以物稀为贵，亦讲难能可贵”；对于古陶瓷与书画艺术的有机联系，特别是对唐宋陶瓷的推崇，多有阐发。行文雅秀、旁征博引而不失明晰；注释、附录亦堪称周备。蒙读者厚爱，《中国陶瓷史》在初版三年后得以再版。新版增订至近55万字，图版增换计170余帧，其中既有出自各博物馆及私人珍藏，也有作者实地考察所摄罕见之物。', '叶喆民', '生活.读书.新知三联书店', '2014-03-01', '0', '0', '0', '6','2','12');
INSERT INTO `book` VALUES ('13', '美国纽约摄影学院', '/picture/13.jpg', '98', '一本经久实用的教材总是引导我们去把握摄影作晶与影像之外的时空所形成的各种相互冲突和相互生成的关系，从而使得视觉的权力越来越具有主体性。这本实际而通俗的摄影入门书，很好地解答了我对于摄影技术的疑惑，它会让你成为优秀的摄影匠，如果你继续深入阅读与实践，*终会成为优秀的摄影家', '美国纽约摄影学院', '中国摄影出版社', '2010-08-01', '0', '0', '0', '7','2','13');
INSERT INTO `book` VALUES ('14', '单反摄影宝典', '/picture/14.jpg', '44.5', '本书不是简单的为讲解技法而讲解的，而是通过萃取目前国内外最创新的拍摄技法，结合作者多年的实战拍摄经验，整合出一套最适合读者需求的摄影技法宝典。内容全面丰富，包括：1，操作技术——菜单、曝光模式、白平衡、感光度、光圈、快门等操作控制；2，拍摄技法——水平线构图、对角线构图、曲线构图、三角形构图、突破性构图等构图方法，以及顺光、侧光、逆光、色彩搭配等用光法则；3，主题拍摄——风光、人像、建筑和园林、花卉、夜景、体育、动物、静物、美食、展场和舞台等不同主题的实战拍摄；4，镜头与附件——人像镜头、风光镜头、微距镜头等性价比最高的镜头推荐，以及必备的滤镜、摄影包、三脚架、闪光灯等附件的推荐；5，后期技术——色彩优化、曝光调整、对比度调整、曲线应用等。', '雷依里，郑毅', '水利水电出版社', '2012-06-01', '0', '0', '0', '7','2','14');
INSERT INTO `book` VALUES ('15', '汉字书法之美', '/picture/15.jpg', '33.1', '五千多年前，象征黎明曙光的第一个汉字出现了，文字在天地之间被创造出来，在动物骨骸、金属、石头、竹简、纸帛上被记录下来，在各个朝代以或沉重朴厚，或飞扬婉转，或森严宏大，或肆意狂放的书写线条，完成了每个时代美学最集中的表现。到了现代，汉字不曾消失、不肯遗忘，更将拥有悠长丰沛的活力。', '蒋勋', '广西师范大学出版社', '2014-08-01', '0', '0', '0', '8','2','15');
INSERT INTO `book` VALUES ('16', '中国书法', '/picture/16.jpg', '29.9', '中国书法包含丰富而复杂的技法，但从无一份关于全部技法的清单。《中国书法：167个练习》是一部以167个练习组成的书法技法教材，这167个练习包括了传统书法和现代书法创作的全部基本技法。其中包含一些从未被讨论过的内容。', '邱振中', '中国人民大学出版社', '2005-06-01', '0', '0', '0', '8','2','16');
INSERT INTO `book` VALUES ('17', '脊椎病因治疗学', '/picture/17.jpg', '44.9', '脊椎病因治疗学是研究脊椎遭受损害后，对脊髓、周围神经、血管及内脏神经连带出现的一系列病症采用治脊疗法治疗的一门新兴学说。脊椎相关疾病的发现，为一些常见疾病的发病补充了新的病因学说，为临床疑难病症开辟了一条新而有效的诊治途径，在医学界影响深远。', '龙层花 ', '世界图书出版公司', '2012-06-01', '0', '1', '0', '9','2','17');
INSERT INTO `book` VALUES ('18', '实用骨科学', '/picture/18.jpg', '398.4', '本书由骨科学权威专家集体编著，在前3版的基础上修订而成，共5篇59章，前两篇为上册，后三篇为下册。第一篇骨科基础，包括骨骼、关节软骨、骨骺、脊柱、脊髓的形态结构、生理功能、病理改变和四肢关节运动的生物力学，骨科物理检查、影像学检查和其他辅助检查，固定、牵引、手法复位、关节穿刺等常用治疗技术，四肢与脊柱手术途径和围术期处理，关节镜技术和骨科常见严重并发症等；第二篇创伤骨科，包括骨与关节常见创伤，骨折愈合及其影响因素，各种固定技术与器械，上肢、颈椎、胸腰椎、脊髓、骨盆、下肢、周围神经、四肢血管、骨骺、关节等损伤的处理，以及火器伤、骨不连、畸形愈合、断肢、断掌和断指再植等；第三篇骨病，包括先天性、代谢性骨病，骨与关节感染，大脑性瘫痪后遗症，骨肿瘤与肿瘤样疾患，骨坏死与腱鞘滑囊疾病等；第四篇部位骨科，包括肩、肘、手、脊柱、髋、膝、足部疾病；第五篇修复与重建，包括骨移植，骨科肌瓣与肌皮瓣的应用，显微外科，足外伤缺损修复重建，人工关节，截肢、假肢与支具，以及关节矫形术等。作者以总结自己的实践经验为主，同时吸收了国内外近年来对骨科学研究的最新成果，较全面地反映了骨科学的发展水平。', '胥少汀', '人民军医出版社', '2012-01-01', '0', '1', '0', '9','2','18');
INSERT INTO `book` VALUES ('19', '住宅设计的34个法则', '/picture/19.jpg', '23.9', '作者说，想要掌握使住宅舒适的学问，并且对住宅灌注温柔的情感。如此，住宅设计的34个法则告诉你，不仅要住，还想宅在里面。', '中山繁信', '江苏科学技术出版社', '2014-08-01', '0', '0', '1', '10','2','19');
-- ----------------------------
-- Table structure for `category`
-- ----------------------------
DROP TABLE IF EXISTS `category`;
CREATE TABLE `category` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of category
-- ----------------------------
INSERT INTO `category` VALUES ('1', '经典著作');
INSERT INTO `category` VALUES ('2', '社会科学');
INSERT INTO `category` VALUES ('3', '自然科学');
INSERT INTO `category` VALUES ('4', '历史地理');
INSERT INTO `category` VALUES ('5', '中国文学');
INSERT INTO `category` VALUES ('6', '美术雕塑');
INSERT INTO `category` VALUES ('7', '摄影影视');
INSERT INTO `category` VALUES ('8', '书法篆刻');
INSERT INTO `category` VALUES ('9', '医药卫生');
INSERT INTO `category` VALUES ('10', '建筑工程');
INSERT INTO `category` VALUES ('11', '生活休闲');
INSERT INTO `category` VALUES ('12', '少儿读物');


-- ----------------------------
-- Table structure for `items`
-- ----------------------------
DROP TABLE IF EXISTS `items`;
CREATE TABLE `items` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `amount` int(11) DEFAULT NULL COMMENT '数量',
  `book_id` int(11) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `book_name` int(11) DEFAULT NULL,
  `user_name` int(11) DEFAULT NULL,
  `total` float DEFAULT NULL COMMENT '价格',
  
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of items
-- ----------------------------

-- ----------------------------
-- Table structure for `users`
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) DEFAULT NULL COMMENT '用户名',
  `password` varchar(255) DEFAULT NULL COMMENT '密码',
  `phone` varchar(255) DEFAULT NULL COMMENT '电话',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('1', '1', 'iUOoOdMAl7FsB1Kig37hmg==', '12312341234');
